In [1]:
import pandas as pd
import numpy as np

Here, I download as csv file and read by pandas library

Loading all the datasets:

In [2]:
transaction = pd.read_csv('Data_Transaction.csv')
comission = pd.read_csv('Data_Comission.csv')
user = pd.read_csv('Data_User_Info.csv')

# Data processing

## Performing Exploratory Data Analysis

> Evaluate: data type check/ null check/ data consistency/ data validation

In [3]:
transaction.head()

    user_id    order_id        Date  Amount  Merchant_id Purchase_status
0  21269588  4169517626  2020-01-01  10,000           13             NaN
1  28097592  4170276686  2020-01-01  20,000           13             NaN
2  47435144  4166729310  2020-01-01  10,000           12             NaN
3  29080935  4174460303  2020-01-01  10,000           13             NaN
4  14591075  4168216749  2020-01-01  10,000           12             NaN

In [4]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13495 entries, 0 to 13494
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   user_id          13495 non-null  int64
 1   order_id         13495 non-null  int64
 2   Date             13495 non-null  object
 3   Amount           13495 non-null  object
 4   Merchant_id      13495 non-null  int64
 5   Purchase_status  2235 non-null   object
dtypes: int64(3), object(3)
memory usage: 632.7+ KB

> change data types

In [5]:
transaction['Amount'] = transaction['Amount'].str.replace(',','')

In [6]:
transaction['Date']= pd.to_datetime(transaction['Date'],errors='coerce')

In [7]:
transaction = transaction.astype({"Amount": int})

> filling null values

In [8]:
transaction['Purchase_status'] = transaction['Purchase_status'].fillna('Direct Sale')

> data consistency/readable

In [9]:
transaction['Purchase_status'] = transaction['Purchase_status'].replace('Mua há»™', 'Purchase for Others')
transaction['Purchase_status'].unique()

array(['Direct Sale', 'Purchase for Others'], dtype=object)

In [10]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13495 entries, 0 to 13494
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   user_id          13495 non-null  int64
 1   order_id         13495 non-null  int64
 2   Date             13495 non-null  datetime64[ns]
 3   Amount           13495 non-null  int64
 4   Merchant_id      13495 non-null  int64
 5   Purchase_status  13495 non-null  object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 632.7+ KB

In [11]:
comission.head()

  Merchant_name  Merchant_id  Rate_pct
0       Viettel           12         2
1      Mobifone           13         3
2     Vinaphone           14         4
3  Vietnamobile           15         4
4       Gmobile           16         4

In [12]:
comission.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Merchant_name  5 non-null      object
 1   Merchant_id    5 non-null      int64
 2   Rate_pct       5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [13]:
user.head()

    User_id First_tran_date      Location       Age  Gender
0  41654498      2018-05-02          HCMC  33_to_37    MALE
1  51276281      2019-12-08  Other Cities   unknown    MALE
2  49152375      2019-12-20  Other Cities  23_to_27    MALE
3   5971050      2019-08-01          HCMC  28_to_32    MALE
4  48134464      2019-08-23  Other Cities  18_to_22  FEMALE

In [14]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13428 entries, 0 to 13427
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User_id          13428 non-null  int64
 1   First_tran_date  13428 non-null  object
 2   Location         13428 non-null  object
 3   Age              13428 non-null  object
 4   Gender           13428 non-null  object
dtypes: int64(1), object(4)
memory usage: 524.7+ KB

> change data types

In [15]:
user['First_tran_date']= pd.to_datetime(user['First_tran_date'],errors='coerce')

In [16]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13428 entries, 0 to 13427
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User_id          13428 non-null  int64
 1   First_tran_date  13354 non-null  datetime64[ns]
 2   Location         13428 non-null  object
 3   Age              13428 non-null  object
 4   Gender           13428 non-null  object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 524.7+ KB

> discover null data for column **First_tran_date** after changing type for **DATE**

In [17]:
user[user['First_tran_date'].isnull()].head(10)

       User_id First_tran_date      Location       Age  Gender
321   40047649             NaT          HCMC  23_to_27    MALE
450   40077417             NaT          HCMC  28_to_32  FEMALE
553   40062809             NaT            HN  28_to_32    MALE
913   40043166             NaT          HCMC  28_to_32  FEMALE
926   40039169             NaT          HCMC       >37    MALE
1141  40030848             NaT          HCMC       >37    MALE
1222  40078897             NaT          HCMC  18_to_22  FEMALE
1280  40082842             NaT            HN  23_to_27    MALE
1374  40003616             NaT          HCMC  23_to_27    MALE
1459  40073038             NaT  Other Cities   unknown    MALE

> cross check with original data source --> date are in incorrect format such as '9087-01-20' --> **eliminate** those records

In [18]:
user = user[user['First_tran_date'].notnull()]

> check data consistency

In [19]:
print(user['Location'].unique())
print(user['Age'].unique())
print(user['Gender'].unique())

['HCMC' 'Other Cities' 'Other' 'HN' 'Unknown' 'Ho Chi Minh City']
['33_to_37' 'unknown' '23_to_27' '28_to_32' '18_to_22' '>37']
['MALE' 'FEMALE' 'Ná»¯' 'M' 'female' 'Nam' 'f' 'male']

In [20]:
user['Location'] = user['Location'].replace({'HCMC':'Ho Chi Minh City','HN':'Ha Noi','Other Cities':'Other'})
user['Gender'] = user['Gender'].replace({'MALE':'M','Nam':'M','male':'M','FEMALE':'F','Ná»¯':'F','female':'F','f':'F'})

> validate the change

In [21]:
print(user['Location'].unique())
print(user['Age'].unique())
print(user['Gender'].unique())

['Ho Chi Minh City' 'Other' 'Ha Noi' 'Unknown']
['33_to_37' 'unknown' '23_to_27' '28_to_32' '18_to_22' '>37']
['M' 'F']

### 1) Using data from the 'Commission' table, add a column 'Revenue' in the 'Transactions' table that displays MoMo's earned revenue for each order, and then calculate MoMo's total revenue in January 2020.	

### 2) What is MoMo's most profitable month?

In [22]:
transaction=pd.merge(transaction,comission,on='Merchant_id')
transaction.head()

,user_id,order_id,Date,Amount,Merchant_id,Purchase_status,Merchant_name,Rate_pct
0,21269588,4169517626,2020-01-01,10000,13,Direct Sale,Mobifone,3
1,28097592,4170276686,2020-01-01,20000,13,Direct Sale,Mobifone,3
2,29080935,4174460303,2020-01-01,10000,13,Direct Sale,Mobifone,3
3,50568745,4168401164,2020-01-01,10000,13,Direct Sale,Mobifone,3
4,42275799,4174262889,2020-01-01,50000,13,Direct Sale,Mobifone,3

In [23]:
transaction['Revenue'] = transaction['Amount']*transaction['Rate_pct']/100

In [24]:
monthly_revenue = transaction.groupby(transaction['Date'].dt.to_period('M'))['Revenue'].sum().reset_index()
monthly_revenue.sort_values(by='Revenue', ascending=False, inplace=True)

In [25]:
monthly_revenue

       Date     Revenue
8   2020-09  1702200.00
9   2020-10  1690900.00
11  2020-12  1638200.00
7   2020-08  1618700.00
5   2020-06  1617200.00
2   2020-03  1584000.00
6   2020-07  1581900.00
10  2020-11  1539300.00
3   2020-04  1488300.00
4   2020-05  1463700.00
0   2020-01  1409827.02
1   2020-02  1378500.00

MoMo's total revenue in January 2020 is 1,409,827.02

MoMo's most profitable month is September 2020

### What day of the week does MoMo make the most money, on average? The least money?

In [26]:
transaction['Day_of_Week'] = transaction['Date'].dt.dayofweek.map({
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: 'Friday',
    5: 'Saturday',
    6: 'Sunday'
})
transaction.head()

,user_id,order_id,Date,Amount,Merchant_id,Purchase_status,Merchant_name,Rate_pct,Revenue,Day_of_Week
0,21269588,4169517626,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday
1,28097592,4170276686,2020-01-01,20000,13,Direct Sale,Mobifone,3,600.0,Wednesday
2,29080935,4174460303,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday
3,50568745,4168401164,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday
4,42275799,4174262889,2020-01-01,50000,13,Direct Sale,Mobifone,3,1500.0,Wednesday

In [27]:
dow_revenue = transaction.groupby(transaction['Day_of_Week'])['Revenue'].mean().reset_index()
dow_revenue.sort_values(by='Revenue', ascending=False, inplace=True)
dow_revenue

  Day_of_Week      Revenue
6   Wednesday  1482.535075
4    Thursday  1411.190598
0      Friday  1408.213041
5     Tuesday  1401.358412
2    Saturday  1376.099946
3      Sunday  1308.042408
1      Monday  1304.437564

Wednesday is the most profitable day of the week while Monday is the least profitable

### 	4	Combined with the 'User_Info' table, add columns: Age, Gender, Location, Type_user (New/Current) in 'Transactions' table and calculate the total number of new users in December 2020.

In [28]:
final = pd.merge(transaction,user,left_on='user_id', right_on='User_id', how= 'left')
final.drop(columns=['User_id'], inplace=True)
final.head()

,user_id,order_id,Date,Amount,Merchant_id,Purchase_status,Merchant_name,Rate_pct,Revenue,Day_of_Week,First_tran_date,Location,Age,Gender
0,21269588,4169517626,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2018-12-11,Ha Noi,>37,F
1,28097592,4170276686,2020-01-01,20000,13,Direct Sale,Mobifone,3,600.0,Wednesday,2019-12-30,Ha Noi,>37,F
2,29080935,4174460303,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2019-10-24,Ha Noi,18_to_22,F
3,50568745,4168401164,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2019-11-07,Other,23_to_27,F
4,42275799,4174262889,2020-01-01,50000,13,Direct Sale,Mobifone,3,1500.0,Wednesday,2019-10-18,Ha Noi,28_to_32,F

In [29]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13576 entries, 0 to 13575
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   user_id          13576 non-null  int64
 1   order_id         13576 non-null  int64
 2   Date             13576 non-null  datetime64[ns]
 3   Amount           13576 non-null  int64
 4   Merchant_id      13576 non-null  int64
 5   Purchase_status  13576 non-null  object
 6   Merchant_name    13576 non-null  object
 7   Rate_pct         13576 non-null  int64
 8   Revenue          13576 non-null  float64
 9   Day_of_Week      13576 non-null  object
 10  First_tran_date  13502 non-null  datetime64[ns]
 11  Location         13502 non-null  object
 12  Age              13502 non-null  object
 13  Gender           13502 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(5), object(6)
memory usage: 1.6+ MB

> Cross check with original source and there are cases we have **User perform the transaction** but their **infomation not in the User table** --> eliminate those

In [30]:
final = final[final['First_tran_date'].notnull()]

In [31]:
final.head()

,user_id,order_id,Date,Amount,Merchant_id,Purchase_status,Merchant_name,Rate_pct,Revenue,Day_of_Week,First_tran_date,Location,Age,Gender
0,21269588,4169517626,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2018-12-11,Ha Noi,>37,F
1,28097592,4170276686,2020-01-01,20000,13,Direct Sale,Mobifone,3,600.0,Wednesday,2019-12-30,Ha Noi,>37,F
2,29080935,4174460303,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2019-10-24,Ha Noi,18_to_22,F
3,50568745,4168401164,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2019-11-07,Other,23_to_27,F
4,42275799,4174262889,2020-01-01,50000,13,Direct Sale,Mobifone,3,1500.0,Wednesday,2019-10-18,Ha Noi,28_to_32,F

In [32]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13502 entries, 0 to 13575
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   user_id          13502 non-null  int64
 1   order_id         13502 non-null  int64
 2   Date             13502 non-null  datetime64[ns]
 3   Amount           13502 non-null  int64
 4   Merchant_id      13502 non-null  int64
 5   Purchase_status  13502 non-null  object
 6   Merchant_name    13502 non-null  object
 7   Rate_pct         13502 non-null  int64
 8   Revenue          13502 non-null  float64
 9   Day_of_Week      13502 non-null  object
 10  First_tran_date  13502 non-null  datetime64[ns]
 11  Location         13502 non-null  object
 12  Age              13502 non-null  object
 13  Gender           13502 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(5), object(6)
memory usage: 1.5+ MB

In [33]:
final['Date_Month_Year'] = final['Date'].dt.to_period('M')
final['First_tran_Month_Year'] = final['First_tran_date'].dt.to_period('M')

# Compare month and year components
final['New/Current'] = final.apply(lambda row: 'New' if row['Date_Month_Year'] <= row['First_tran_Month_Year'] else 'Current', axis=1)

# Drop intermediate columns
final.drop(['Date_Month_Year', 'First_tran_Month_Year'], axis=1, inplace=True)

In [34]:
december_trans = final[final['Date'].dt.to_period('M') == '2020-12']

In [35]:
december_trans.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1295 entries, 3420 to 13572
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   user_id          1295 non-null   int64
 1   order_id         1295 non-null   int64
 2   Date             1295 non-null   datetime64[ns]
 3   Amount           1295 non-null   int64
 4   Merchant_id      1295 non-null   int64
 5   Purchase_status  1295 non-null   object
 6   Merchant_name    1295 non-null   object
 7   Rate_pct         1295 non-null   int64
 8   Revenue          1295 non-null   float64
 9   Day_of_Week      1295 non-null   object
 10  First_tran_date  1295 non-null   datetime64[ns]
 11  Location         1295 non-null   object
 12  Age              1295 non-null   object
 13  Gender           1295 non-null   object
 14  New/Current      1295 non-null   object
dtypes: datetime64[ns](2), float64(1), int64(5), object(7)
memory usage: 161.9+ KB

In [36]:
december_trans[december_trans['New/Current'] == 'New']['user_id'].nunique()

72

The total number of new users in December 2020 : 72 users

In [37]:
final.head()

,user_id,order_id,Date,Amount,Merchant_id,Purchase_status,Merchant_name,Rate_pct,Revenue,Day_of_Week,First_tran_date,Location,Age,Gender,New/Current
0,21269588,4169517626,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2018-12-11,Ha Noi,>37,F,Current
1,28097592,4170276686,2020-01-01,20000,13,Direct Sale,Mobifone,3,600.0,Wednesday,2019-12-30,Ha Noi,>37,F,Current
2,29080935,4174460303,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2019-10-24,Ha Noi,18_to_22,F,Current
3,50568745,4168401164,2020-01-01,10000,13,Direct Sale,Mobifone,3,300.0,Wednesday,2019-11-07,Other,23_to_27,F,Current
4,42275799,4174262889,2020-01-01,50000,13,Direct Sale,Mobifone,3,1500.0,Wednesday,2019-10-18,Ha Noi,28_to_32,F,Current

In [38]:
transaction.to_csv('final_transaction.csv')
user.to_csv('final_user.csv')
comission.to_csv('final_comission.csv')